const brailleMap = {
  "あ": "1",
  "い": "12",
  "う": "14",
  "え": "124",
  "お": "24",

  "か": "16",
  "き": "126",
  "く": "146",
  "け": "1246",
  "こ": "246",

  "さ": "156",
  "し": "1256",
  "す": "1456",
  "せ": "12456",
  "そ": "2456",

  "た": "15",
  "ち": "125",
  "つ": "145",
  "て": "1245",
  "と": "245",

  "な": "135",
  "に": "1235",
  "ぬ": "1345",
  "ね": "13456",
  "の": "3456",

  "は": "136",
  "ひ": "1236",
  "ふ": "1346",
  "へ": "12346",
  "ほ": "346",

  "ま": "1356",
  "み": "12356",
  "む": "13456",
  "め": "2456",
  "も": "356",

  "や": "34",
  "ゆ": "346",
  "よ": "35",

  "ら": "123",
  "り": "1235",
  "る": "1236",
  "れ": "12356",
  "ろ": "135",

  "わ": "245",
  "を": "125",
  "ん": "356",

  // 拗音
  "きゃ": "126-34",
  "きゅ": "126-346",
  "きょ": "126-35",

  "しゃ": "1256-34",
  "しゅ": "1256-346",
  "しょ": "1256-35",

  "ちゃ": "125-34",
  "ちゅ": "125-346",
  "ちょ": "125-35"
};

function convertToBraille() {
  const input = document.getElementById("hiraganaInput").value;
  let result = [];

  for (let i = 0; i < input.length; i++) {

    // 2文字確認
    const twoChars = input[i] + input[i + 1];

    if (brailleMap[twoChars]) {
      result.push(brailleMap[twoChars]);
      i++;
    } else {
      result.push(brailleMap[input[i]] || "?");
    }
  }

  document.getElementById("brailleResult").textContent =
    result.join(" / ");
}
